# Occupation

### Introduction:


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [5]:
data = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|')
data

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
5          6   42      M      executive    98101
6          7   57      M  administrator    91344
7          8   36      M  administrator    05201
8          9   29      M        student    01002
9         10   53      M         lawyer    90703
10        11   39      F          other    30329
11        12   28      F          other    06405
12        13   47      M       educator    29206
13        14   45      M      scientist    55106
14        15   49      F       educator    97301
15        16   21      M  entertainment    10309
16        17   30      M     programmer    06355
17        18   35      F          other    37212
18        19   40      M      librarian    02138
19        20   42      F      homemaker    95660
20        21   26      M         writer    30068
21        22   25      M         writer    40206
22        23   30      F         artist    48197
23        24   21      F         artist    94533
24        25   39      M       engineer    55107
25        26   49      M       engineer    21044
26        27   40      F      librarian    30030
27        28   32      M         writer    55369
28        29   41      M     programmer    94043
29        30    7      M        student    55436
..       ...  ...    ...            ...      ...
913      914   44      F          other    08105
914      915   50      M  entertainment    60614
915      916   27      M       engineer    N2L5N
916      917   22      F        student    20006
917      918   40      M      scientist    70116
918      919   25      M          other    14216
919      920   30      F         artist    90008
920      921   20      F        student    98801
921      922   29      F  administrator    21114
922      923   21      M        student    E2E3R
923      924   29      M          other    11753
924      925   18      F       salesman    49036
925      926   49      M  entertainment    01701
926      927   23      M     programmer    55428
927      928   21      M        student    55408
928      929   44      M      scientist    53711
929      930   28      F      scientist    07310
930      931   60      M       educator    33556
931      932   58      M       educator    06437
932      933   28      M        student    48105
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

### Step 4. Discover what is the mean age per occupation

In [9]:
data.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [12]:
temp = data.copy(deep=True)
temp = data.pivot_table(index='occupation', columns='gender', aggfunc='size', fill_value=0)
sums = temp[['F', 'M']].sum(axis=1)
temp['MaleRatio'] = temp['M'] / sums
print(temp.sort_values(by='MaleRatio', ascending=False))

gender          F    M  MaleRatio
occupation
doctor          0    7   1.000000
engineer        2   65   0.970149
technician      1   26   0.962963
retired         1   13   0.928571
programmer      6   60   0.909091
executive       3   29   0.906250
scientist       3   28   0.903226
entertainment   2   16   0.888889
lawyer          2   10   0.833333
salesman        3    9   0.750000
educator       26   69   0.726316
student        60  136   0.693878
other          36   69   0.657143
marketing      10   16   0.615385
writer         19   26   0.577778
none            4    5   0.555556
administrator  36   43   0.544304
artist         13   15   0.535714
librarian      29   22   0.431373
healthcare     11    5   0.312500
homemaker       6    1   0.142857

### Step 6. For each occupation, calculate the minimum and maximum ages

In [21]:
age_sep = pd.concat([data.groupby('occupation').age.min(), data.groupby('occupation').age.max()], axis=1)
age_sep.columns = ['min_age','max_age']
age_sep

               min_age  max_age
occupation
administrator       21       70
artist              19       48
doctor              28       64
educator            23       63
engineer            22       70
entertainment       15       50
executive           22       69
healthcare          22       62
homemaker           20       50
lawyer              21       53
librarian           23       69
marketing           24       55
none                11       55
other               13       64
programmer          20       63
retired             51       73
salesman            18       66
scientist           23       55
student              7       42
technician          21       55
writer              18       60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [27]:
data.groupby(['occupation', 'gender']).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [53]:
tm = pd.concat([data[data.gender == 'M'].groupby('occupation').gender.count(), data[data.gender == 'F'].groupby('occupation').gender.count()], axis=1, sort=False)
tm.columns = ['M','F']
print(tm)
tm['F'].replace(np.nan, 0, inplace = True)
print(tm)
tm['percentage_of_women'] = tm.loc[:,'F'] / (tm.loc[:,'M'] + tm.loc[:,'F']) * 100
tm['percentage_of_men'] = tm.loc[:,'M'] / (tm.loc[:,'M'] + tm.loc[:,'F']) * 100
#tm.drop(columns=['1','2'], inplace=True)
tm

                 M     F
administrator   43  36.0
artist          15  13.0
doctor           7   NaN
educator        69  26.0
engineer        65   2.0
entertainment   16   2.0
executive       29   3.0
healthcare       5  11.0
homemaker        1   6.0
lawyer          10   2.0
librarian       22  29.0
marketing       16  10.0
none             5   4.0
other           69  36.0
programmer      60   6.0
retired         13   1.0
salesman         9   3.0
scientist       28   3.0
student        136  60.0
technician      26   1.0
writer          26  19.0
                 M     F
administrator   43  36.0
artist          15  13.0
doctor           7   0.0
educator        69  26.0
engineer        65   2.0
entertainment   16   2.0
executive       29   3.0
healthcare       5  11.0
homemaker        1   6.0
lawyer          10   2.0
librarian       22  29.0
marketing       16  10.0
none             5   4.0
other           69  36.0
programmer      60   6.0
retired         13   1.0
salesman         9   3.0
scientist       28   3.0
student        136  60.0
technician      26   1.0
writer          26  19.0

                 M     F  percentage_of_women  percentage_of_men
administrator   43  36.0            45.569620          54.430380
artist          15  13.0            46.428571          53.571429
doctor           7   0.0             0.000000         100.000000
educator        69  26.0            27.368421          72.631579
engineer        65   2.0             2.985075          97.014925
entertainment   16   2.0            11.111111          88.888889
executive       29   3.0             9.375000          90.625000
healthcare       5  11.0            68.750000          31.250000
homemaker        1   6.0            85.714286          14.285714
lawyer          10   2.0            16.666667          83.333333
librarian       22  29.0            56.862745          43.137255
marketing       16  10.0            38.461538          61.538462
none             5   4.0            44.444444          55.555556
other           69  36.0            34.285714          65.714286
programmer      60   6.0             9.090909          90.909091
retired         13   1.0             7.142857          92.857143
salesman         9   3.0            25.000000          75.000000
scientist       28   3.0             9.677419          90.322581
student        136  60.0            30.612245          69.387755
technician      26   1.0             3.703704          96.296296
writer          26  19.0            42.222222          57.777778